In [1]:
#importing python libraries
from datascience import *

import numpy as np

%matplotlib inline

<b> Learning Cell Headers <b>

In [2]:
24 * 7

168

In [3]:
hours_in_a_week = 24 * 7

In [4]:
hours_in_a_week

168

In [5]:
hours_in_a_week * 100

16800

In [6]:
60 * 60 * 24 * 365

31536000

In [7]:
seconds_per_year = 60 * 60 * 24 * 365

In [8]:
seconds_per_year

31536000

In [9]:
#built in functions
abs(-8)

8

In [10]:
abs(3-8)

5

In [11]:
max(3,4)

4

In [12]:
y = max(3,4)

In [13]:
y

4

<b> Tables! <b>

In [14]:
Table.read_table('flowers.csv')

Petals | Name      | Color
8      | lotus     | pink
34     | sunflower | yellow
5      | rose      | red

In [15]:
flowers = Table.read_table('flowers.csv')

In [16]:
flowers

Petals | Name      | Color
8      | lotus     | pink
34     | sunflower | yellow
5      | rose      | red

In [17]:
flowers.select('Petals')

Petals
8
34
5

In [18]:
flowers

Petals | Name      | Color
8      | lotus     | pink
34     | sunflower | yellow
5      | rose      | red

In [19]:
flowers.select('Petals','Name')

Petals | Name
8      | lotus
34     | sunflower
5      | rose

In [20]:
flowers.drop('Color')

Petals | Name
8      | lotus
34     | sunflower
5      | rose

In [21]:
flowers

Petals | Name      | Color
8      | lotus     | pink
34     | sunflower | yellow
5      | rose      | red

In [22]:
movies = Table.read_table('top_movies_by_title.csv')

In [23]:
movies

Title                      | Studio               | Gross     | Gross (Adjusted) | Year
101 Dalmatians             | Disney               | 144880014 | 869280100        | 1961
2001: A Space Odyssey      | MGM                  | 56954992  | 377027700        | 1968
9 to 5                     | Fox                  | 103290500 | 334062200        | 1980
A Star Is Born (1976)      | Warner Bros.         | 80000000  | 326760600        | 1976
Air Force One              | Sony                 | 172956409 | 327752300        | 1997
Airport                    | Universal            | 100489151 | 575168200        | 1970
Aladdin                    | Buena Vista (Disney) | 217350219 | 456248400        | 1992
Alice in Wonderland (2010) | Buena Vista (Disney) | 334191110 | 365718600        | 2010
American Graffiti          | Universal            | 115000000 | 571714300        | 1973
American Sniper            | Warner Bros.         | 350126372 | 374796000        | 2014
... (190 rows omitted)

In [26]:
movies.sort('Year', descending = True)

Title                                 | Studio               | Gross     | Gross (Adjusted) | Year
Star Wars: The Force Awakens          | Buena Vista (Disney) | 906723418 | 906723400        | 2015
Minions                               | Universal            | 336045770 | 354213900        | 2015
Jurassic World                        | Universal            | 652270625 | 687728000        | 2015
Inside Out                            | Buena Vista (Disney) | 356461711 | 375723400        | 2015
Furious 7                             | Universal            | 353007020 | 356907000        | 2015
Avengers: Age of Ultron               | Buena Vista (Disney) | 459005868 | 465684200        | 2015
The Hunger Games: Mockingjay - Part 1 | Lionsgate            | 337135885 | 354324000        | 2014
Guardians of the Galaxy               | Buena Vista (Disney) | 333176600 | 358244800        | 2014
American Sniper                       | Warner Bros.         | 350126372 | 374796000        | 2014
The Hunger Games: Catching Fire       | Lionsgate            | 424668047 | 444697400        | 2013
... (190 rows omitted)

In [27]:
movies.show(3)

In [28]:
movies.sort('Gross')

Title                               | Studio       | Gross    | Gross (Adjusted) | Year
The Four Horsemen of the Apocalypse | MPC          | 9183673  | 399489800        | 1921
Sergeant York                       | Warner Bros. | 16361885 | 418671800        | 1941
Duel in the Sun                     | Selz.        | 20408163 | 443877500        | 1946
The Bells of St. Mary's             | RKO          | 21333333 | 545882400        | 1945
The Caine Mutiny                    | Columbia     | 21750000 | 386173500        | 1954
The Best Years of Our Lives         | RKO          | 23650000 | 478500000        | 1946
House of Wax                        | Warner Bros. | 23750000 | 439627700        | 1953
The Bridge on the River Kwai        | Columbia     | 27200000 | 473280000        | 1957
Psycho                              | Universal    | 32000000 | 371200100        | 1960
The Greatest Show on Earth          | Paramount    | 36000000 | 522000000        | 1952
... (190 rows omitted)

In [29]:
sorted_by_gross = movies.sort('Gross')

In [30]:
sorted_by_gross

Title                               | Studio       | Gross    | Gross (Adjusted) | Year
The Four Horsemen of the Apocalypse | MPC          | 9183673  | 399489800        | 1921
Sergeant York                       | Warner Bros. | 16361885 | 418671800        | 1941
Duel in the Sun                     | Selz.        | 20408163 | 443877500        | 1946
The Bells of St. Mary's             | RKO          | 21333333 | 545882400        | 1945
The Caine Mutiny                    | Columbia     | 21750000 | 386173500        | 1954
The Best Years of Our Lives         | RKO          | 23650000 | 478500000        | 1946
House of Wax                        | Warner Bros. | 23750000 | 439627700        | 1953
The Bridge on the River Kwai        | Columbia     | 27200000 | 473280000        | 1957
Psycho                              | Universal    | 32000000 | 371200100        | 1960
The Greatest Show on Earth          | Paramount    | 36000000 | 522000000        | 1952
... (190 rows omitted)

In [38]:
sorted_by_gross = movies.where('Studio','RKO')

In [39]:
sorted_by_gross

Title                       | Studio | Gross     | Gross (Adjusted) | Year
Bambi                       | RKO    | 102247150 | 554298300        | 1942
The Bells of St. Mary's     | RKO    | 21333333  | 545882400        | 1945
The Best Years of Our Lives | RKO    | 23650000  | 478500000        | 1946